PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_smif_memslot.h
#define CY_SMIF_SFDP_BFPT_ERASE_BYTE                (36U)                   /**< The byte 36 of the JEDEC Basic Flash Parameter Table */

#define CY_SMIF_JEDEC_BFPT_10TH_DWORD               (9U)                    /**< Offset to JEDEC Basic Flash Parameter Table: 10th DWORD  */
#define CY_SMIF_JEDEC_BFPT_11TH_DWORD               (10U)                   /**< Offset to JEDEC Basic Flash Parameter Table: 11th DWORD  */

#define CY_SMIF_SFDP_SCCR_MAP_BYTE_3B               (0x3BU)                 /**< DWORD-16 of SCCR Map SPI table */
#define CY_SMIF_SFDP_OCTAL_ENABLE_WRITE_CMD_Pos     (0U)                    /**< SCCR Map DWORD-16 Octal mode enable write command position */
#define CY_SMIF_SFDP_OCTAL_ENABLE_WRITE_CMD_Msk     (0xFFU)                 /**< SCCR Map DWORD-16 Octal mode enable write command mask */
#define CY_SMIF_SFDP_OCTAL_ENABLE_READ_CMD_Pos      (8U)                    /**< SCCR Map DWORD-16 Octal mode enable read command position */
#define CY_SMIF_SFDP_OCTAL_ENABLE_READ_CMD_Msk      (0xFF00U)               /**< SCCR Map DWORD-16 Octal mode enable read command mask */
#define CY_SMIF_SFDP_OCTAL_ENABLE_REG_ADDR_Pos      (16U)                   /**< SCCR Map DWORD-16 Octal mode enable register address position */
#define CY_SMIF_SFDP_OCTAL_ENABLE_REG_ADDR_Msk      (0xFF0000U)             /**< SCCR Map DWORD-16 Octal mode enable register address mask */
#define CY_SMIF_SFDP_OCTAL_ENABLE_BIT_Pos           (24U)                   /**< SCCR Map DWORD-16 Octal mode enable bit position */
#define CY_SMIF_SFDP_OCTAL_ENABLE_BIT_Msk           (0x7000000U)            /**< SCCR Map DWORD-16 Octal mode enable bit mask */
#define CY_SMIF_SFDP_OCTAL_ENABLE_USE_ADDRESS_Pos   (28U)                   /**< SCCR Map DWORD-16 Octal mode enable uses address to set/clear position */
#define CY_SMIF_SFDP_OCTAL_ENABLE_USE_ADDRESS_Msk   (0x10000000U)           /**< SCCR Map DWORD-16 Octal mode enable uses address to set/clear mask */
#define CY_SMIF_SFDP_OCTAL_ENABLE_BIT_SUPPORT_Pos   (31U)                   /**< SCCR Map DWORD-16 Octal mode enable bit support position */
#define CY_SMIF_SFDP_OCTAL_ENABLE_BIT_SUPPORT_Msk   (0x80000000U)           /**< SCCR Map DWORD-16 Octal mode enable bit support mask */

#define CY_SMIF_SFDP_SECTOR_MAP_CMD_OFFSET          (1UL)    /**< The offset for the detection command instruction in the Sector Map command descriptor */
#define CY_SMIF_SFDP_SECTOR_MAP_ADDR_LEN_OFFSET     (2UL)    /**< The offset for the detection command address length in the Sector Map command descriptor */
#define CY_SMIF_SFDP_SECTOR_MAP_REG_MSK_OFFSET      (3UL)    /**< The offset for the read data mask in the Sector Map command descriptor */
#define CY_SMIF_SFDP_SECTOR_MAP_REG_ADDR_OFFSET     (4UL)    /**< The offset for the detection command address in the Sector Map command descriptor */
#define CY_SMIF_SFDP_SECTOR_MAP_REGION_COUNT_OFFSET (2UL)    /**< The offset for the regions count in the Sector Map descriptor */
#define CY_SMIF_SFDP_SECTOR_MAP_CONFIG_ID_OFFSET    (2UL)    /**< The offset for the configuration ID in the Sector Map descriptor */
#define CY_SMIF_SFDP_SECTOR_MAP_SUPPORTED_ET_MASK   (0xFU)   /**< The mask for the supported erase type code in the Sector Map descriptor */
#define CY_SMIF_SFDP_SECTOR_MAP_ADDR_BYTES_Msk      (0xC0UL) /**< The mask for the configuration detection command address bytes in the Sector Map descriptor */
#define CY_SMIF_SFDP_SECTOR_MAP_ADDR_BYTES_Pos      (6UL)    /**< The position of the configuration detection command address bytes in the Sector Map descriptor */
#define CY_SMIF_SFDP_SECTOR_MAP_DUMMY_CYCLES_Msk    (0xFUL)  /**< The mask for the configuration detection command read latency cycles in the Sector Map descriptor */
#define CY_SMIF_SFDP_SECTOR_MAP_DUMMY_CYCLES_Pos    (0UL)    /**< The position of the configuration detection command read latency cycles in the Sector Map descriptor */

#define FOUR_BYTE_ADDRESS_TABLE_BYTE_0              (0U)     /**< Byte 0x00 of the JEDEC 4-byte Address Instruction Table */
#define FOUR_BYTE_ADDRESS_TABLE_BYTE_1              (1U)     /**< Byte 0x01 of the JEDEC 4-byte Address Instruction Table */


/* ----------------------------  1st DWORD  ---------------------------- */
#define CY_SMIF_SFDP_FAST_READ_1_1_4_Pos            (6UL)                   /**< The SFDP 1-1-4 fast read support (Bit 6)               */
#define CY_SMIF_SFDP_FAST_READ_1_1_4_Msk            (0x40UL)                /**< The SFDP 1-1-4 fast read support (Bitfield-Mask: 0x01) */
#define CY_SMIF_SFDP_FAST_READ_1_4_4_Pos            (5UL)                   /**< The SFDP 1-4-4 fast read support (Bit 5)               */
#define CY_SMIF_SFDP_FAST_READ_1_4_4_Msk            (0x20UL)                /**< The SFDP 1-4-4 fast read support (Bitfield-Mask: 0x01) */
#define CY_SMIF_SFDP_FAST_READ_1_2_2_Pos            (4UL)                   /**< The SFDP 1-2-2 fast read support (Bit 4)               */
#define CY_SMIF_SFDP_FAST_READ_1_2_2_Msk            (0x10UL)                /**< The SFDP 1-2-2 fast read support (Bitfield-Mask: 0x01) */

#if (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN)
#define CY_SMIF_SFDP_DTR_SUPPORT_Pos                  (3UL)                   /**< The SFDP DTR support (Bit 3)                           */
#define CY_SMIF_SFDP_DTR_SUPPORT_Msk                  (0x08UL)                /**< The SFDP DTR support (Bitfield-Mask: 0x08)             */
#endif /* CY_IP_MXSMIF_VERSION */

#define CY_SMIF_SFDP_ADDRESS_BYTES_Pos              (1UL)                   /**< The SFDP number of address bytes (Bit 1)               */
#define CY_SMIF_SFDP_ADDRESS_BYTES_Msk              (0x06UL)                /**< The SFDP number of address bytes (Bitfield-Mask: 0x03) */
#define CY_SMIF_SFDP_FAST_READ_1_1_2_Pos            (0UL)                   /**< The SFDP 1-1-2 fast read support (Bit 0)               */
#define CY_SMIF_SFDP_FAST_READ_1_1_2_Msk            (0x01UL)                /**< The SFDP 1-1-2 fast read support (Bitfield-Mask: 0x01) */

/* ----------------------------  2nd DWORD  ---------------------------- */
#define CY_SMIF_SFDP_SIZE_ABOVE_4GB_Msk             (0x80000000UL)          /**< Flash memory density bit define if it >= 4 Gbit  or <= 2Gbit */

/* ----------------------------  3rd DWORD  ---------------------------- */
#define CY_SMIF_SFDP_1_4_4_DUMMY_CYCLES_Pos         (0UL)                   /**< The SFDP number of 1-4-4 fast read dummy cycles (Bit 0)               */
#define CY_SMIF_SFDP_1_4_4_DUMMY_CYCLES_Msk         (0x1FUL)                /**< The SFDP number of 1-4-4 fast read dummy cycles (Bitfield-Mask: 0x1F) */
#define CY_SMIF_SFDP_1_4_4_MODE_CYCLES_Pos          (5UL)                   /**< The SFDP number of 1-4-4 fast read mode cycles (Bit 5)                */
#define CY_SMIF_SFDP_1_4_4_MODE_CYCLES_Msk          (0xE0UL)                /**< The SFDP number of 1-4-4 fast read mode cycles (Bitfield-Mask: 0x07)  */
#define CY_SMIF_SFDP_1_1_4_DUMMY_CYCLES_Pos         (0UL)                   /**< The SFDP number of 1-1-4 fast read dummy cycles (Bit 0)               */
#define CY_SMIF_SFDP_1_1_4_DUMMY_CYCLES_Msk         (0x1FUL)                /**< The SFDP number of 1-1-4 fast read dummy cycles (Bitfield-Mask: 0x1F) */
#define CY_SMIF_SFDP_1_1_4_MODE_CYCLES_Pos          (5UL)                   /**< The SFDP number of 1-1-4 fast read mode cycles (Bit 5)                */
#define CY_SMIF_SFDP_1_1_4_MODE_CYCLES_Msk          (0xE0UL)                /**< The SFDP number of 1-1-4 fast read mode cycles (Bitfield-Mask: 0x07)  */

