PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_smif_memslot.h
/* ----------------------------  4th DWORD  ---------------------------- */
#define CY_SMIF_SFDP_1_1_2_DUMMY_CYCLES_Pos         (0UL)                   /**< The SFDP number of 1_1_2 fast read dummy cycles (Bit 0)               */
#define CY_SMIF_SFDP_1_1_2_DUMMY_CYCLES_Msk         (0x1FUL)                /**< The SFDP number of 1_1_2 fast read dummy cycles (Bitfield-Mask: 0x1F) */
#define CY_SMIF_SFDP_1_1_2_MODE_CYCLES_Pos          (5UL)                   /**< The SFDP number of 1_1_2 fast read mode cycles (Bit 5)                */
#define CY_SMIF_SFDP_1_1_2_MODE_CYCLES_Msk          (0xE0UL)                /**< The SFDP number of 1_1_2 fast read mode cycles (Bitfield-Mask: 0x07)  */
#define CY_SMIF_SFDP_1_2_2_DUMMY_CYCLES_Pos         (0UL)                   /**< The SFDP number of 1_2_2 fast read dummy cycles (Bit 0)               */
#define CY_SMIF_SFDP_1_2_2_DUMMY_CYCLES_Msk         (0x1FUL)                /**< The SFDP number of 1_2_2 fast read dummy cycles (Bitfield-Mask: 0x1F) */
#define CY_SMIF_SFDP_1_2_2_MODE_CYCLES_Pos          (5UL)                   /**< The SFDP number of 1_2_2 fast read mode cycles (Bit 5)                */
#define CY_SMIF_SFDP_1_2_2_MODE_CYCLES_Msk          (0xE0UL)                /**< The SFDP number of 1_2_2 fast read mode cycles (Bitfield-Mask: 0x07)  */

/* ----------------------------  10th DWORD  --------------------------- */
#define CY_SMIF_SFDP_ERASE_T1_COUNT_Pos             (4UL)                   /**< Erase Type 1 Erase, Typical time: count (Bits 8:4) */
#define CY_SMIF_SFDP_ERASE_T1_COUNT_Msk             (0x1F0UL)               /**< Erase Type 1 Erase, Typical time: count (Bitfield-Mask ) */
#define CY_SMIF_SFDP_ERASE_T1_UNITS_Pos             (9UL)                   /**< Erase Type 1 Erase, Typical time: units (Bits 10:9) */
#define CY_SMIF_SFDP_ERASE_T1_UNITS_Msk             (0x600UL)               /**< Erase Type 1 Erase, Typical time: units (Bitfield-Mask ) */
#define CY_SMIF_SFDP_ERASE_MUL_COUNT_Pos            (0UL)                   /**< Multiplier from typical erase time to maximum erase time (Bits 3:0) */
#define CY_SMIF_SFDP_ERASE_MUL_COUNT_Msk            (0x0FUL)                /**< Multiplier from typical erase time to maximum erase time (Bitfield-Mask ) */


/* ----------------------------  11th DWORD  --------------------------- */
#define CY_SMIF_SFDP_PAGE_SIZE_Pos                  (4UL)                   /**< The SFDP page size (Bit 4)                                    */
#define CY_SMIF_SFDP_PAGE_SIZE_Msk                  (0xF0UL)                /**< The SFDP page size (Bitfield-Mask: 0x0F)                      */
#define CY_SMIF_SFDP_PAGE_PROG_COUNT_Pos            (8UL)                   /**< The SFDP Chip Page Program Typical time: count (Bits 12:8)    */
#define CY_SMIF_SFDP_PAGE_PROG_COUNT_Msk            (0x1F00UL)              /**< The SFDP Chip Page Program Typical time: count (Bitfield-Mask)*/
#define CY_SMIF_SFDP_PAGE_PROG_UNITS_Pos            (13UL)                  /**< The SFDP Chip Page Program Typical time: units (Bit 13)       */
#define CY_SMIF_SFDP_PAGE_PROG_UNITS_Msk            (0x2000UL)              /**< The SFDP Chip Page Program Typical time: units (Bitfield-Mask)*/
#define CY_SMIF_SFDP_CHIP_ERASE_COUNT_Pos           (24UL)                  /**< The SFDP Chip Erase Typical time: count (Bits 28:24)          */
#define CY_SMIF_SFDP_CHIP_ERASE_COUNT_Msk           (0x1F000000UL)          /**< The SFDP Chip Erase Typical time: count (Bitfield-Mask)       */
#define CY_SMIF_SFDP_CHIP_ERASE_UNITS_Pos           (29UL)                  /**< The SFDP Chip Erase Typical time: units (Bits 29:30)          */
#define CY_SMIF_SFDP_CHIP_ERASE_UNITS_Msk           (0x60000000UL)          /**< The SFDP Chip Erase Typical time: units (Bitfield-Mask)       */
#define CY_SMIF_SFDP_PROG_MUL_COUNT_Pos             (0UL)                   /**< Multiplier from typical time to max time for Page or byte program (Bits 3:0)          */
#define CY_SMIF_SFDP_PROG_MUL_COUNT_Msk             (0x0FUL)                /**< Multiplier from typical time to max time for Page or byte program (Bitfield-Mask)       */

/* ----------------------------  15th DWORD  --------------------------- */
#define CY_SMIF_SFDP_QE_REQUIREMENTS_Pos            (4UL)                   /**< The SFDP quad enable requirements field (Bit 4)               */
#define CY_SMIF_SFDP_QE_REQUIREMENTS_Msk            (0x70UL)                /**< The SFDP quad enable requirements field (Bitfield-Mask: 0x07) */


/* ----------------------------  16th DWORD  --------------------------- */
#define CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_B7 (1U)                            /**< Issue 0xB7 instruction */
#define CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_WR_EN_B7 (2U)                      /**< Issue write enable instruction followed with 0xB7 */
#define CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_ALWAYS_4_BYTE (0x40U)              /**< Memory always operates in 4-byte mode */
#define CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_B7_CMD (0xB7U)                     /**< The instruction required to enter 4-byte addressing mode */
#define CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_SUPPORTED_MASK (0x7FU)              /**< Mask indicating 4-byte address mode entry supported */

/* ----------------------------  17th DWORD  --------------------------- */
#define CY_SMIF_SFDP_FAST_READ_1_1_8_Pos            (0UL)                  /**< The SFDP 1-1-8 fast read support (Bitfield 24:31)               */
#define CY_SMIF_SFDP_FAST_READ_1_1_8_Msk            (0xFFUL)          /**< The SFDP 1-1-8 fast read support (Bitfield-Mask: 0xFF) */
#define CY_SMIF_SFDP_1_1_8_MODE_CYCLES_Pos          (5UL)                  /**< The SFDP number of 1-1-8 fast read mode cycles (Bitfield 21:23)                */
#define CY_SMIF_SFDP_1_1_8_MODE_CYCLES_Msk          (0xE0UL)            /**< The SFDP number of 1-1-8 fast read mode cycles (Bitfield-Mask: 0xE)  */
#define CY_SMIF_SFDP_1_1_8_DUMMY_CYCLES_Pos         (0UL)                  /**< The SFDP number of 1_1_8 fast read dummy cycles (Bit 16:19)               */
#define CY_SMIF_SFDP_1_1_8_DUMMY_CYCLES_Msk         (0x1FUL)            /**< The SFDP number of 1_1_8 fast read dummy cycles (Bitfield-Mask: 0x1F) */
#define CY_SMIF_SFDP_FAST_READ_1_8_8_Pos            (0UL)                   /**< The SFDP 1-8-8 fast read support (Bitfield 8:15)               */
#define CY_SMIF_SFDP_FAST_READ_1_8_8_Msk            (0xFFUL)              /**< The SFDP 1-8-8 fast read support (Bitfield-Mask: 0xFF) */
#define CY_SMIF_SFDP_1_8_8_MODE_CYCLES_Pos          (5UL)                   /**< The SFDP number of 1-8-8 fast read mode cycles (Bitfield 5:7)                */
#define CY_SMIF_SFDP_1_8_8_MODE_CYCLES_Msk          (0xE0UL)                /**< The SFDP number of 1-8-8 fast read mode cycles (Bitfield-Mask: 0xE)  */
#define CY_SMIF_SFDP_1_8_8_DUMMY_CYCLES_Pos         (0UL)                   /**< The SFDP number of 1_8_8 fast read dummy cycles (Bit 0:4)               */
#define CY_SMIF_SFDP_1_8_8_DUMMY_CYCLES_Msk         (0x1FUL)                 /**< The SFDP number of 1_8_8 fast read dummy cycles (Bitfield-Mask: 0x1F) */

/* ----------------------------  19th DWORD  --------------------------- */
#define CY_SMIF_SFDP_OCTAL_ENABE_BIT_Pos            (20UL)                  /**< Octal Enable bit present in the flash or not (Bitfiled 20:22)*/
#define CY_SMIF_SFDP_OCTAL_ENABE_BIT_Msk            (0x700000)              /**< Octal Enable bit present Mask (Bitfiled-Mask 0x7)*/

/* ---------------------------- xSPI Profile 1.0 ------------------------ */
#define XSPI_PROFILE_1_TABLE_BYTE_0        (0U)           /**< Byte 0x00 of the JEDEC xSPI Profile 1.0 */
#define XSPI_PROFILE_1_TABLE_BYTE_1        (1U)           /**< Byte 0x01 of the JEDEC xSPI Profile 1.0 */
#define XSPI_PROFILE_1_TABLE_BYTE_16       (0x10U)        /**< DWORD 5 => Byte 16 of the JEDEC xSPI Profile 1.0 */

/* ----------------------------  1st DWORD  --------------------------- */
#define CY_SMIF_SFDP_OCTAL_DDR_READ_CMD_Pos         (0UL)                  /**< Octal DDR 8D-8D-8D read command support position (Bitfield 8:15) */
#define CY_SMIF_SFDP_OCTAL_DDR_READ_CMD_Msk         (0xFFUL)               /**< Octal DDR 8D-8D-8D read command support Mask Bitfield-Mask: 0xFF00) */
#define CY_SMIF_SFDP_ODDR_166MHZ_DUMMY_CYCLES_Pos   (27UL)                 /**< Octal DDR 8D-8D-8D dummy cycles for 166 Mhz (Bitfield 27:31) */
#define CY_SMIF_SFDP_ODDR_166MHZ_DUMMY_CYCLES_Msk   (0xF8000000UL)         /**< Octal DDR 8D-8D-8D dummy cycles for 166 Mhz Mask */
#define CY_SMIF_SFDP_ODDR_200MHZ_DUMMY_CYCLES_Pos   (7UL)                  /**< Octal DDR 8D-8D-8D dummy cycles for 200 Mhz (Bitfield 7:11) */
#define CY_SMIF_SFDP_ODDR_200MHZ_DUMMY_CYCLES_Msk   (0xF80UL)               /**< Octal DDR 8D-8D-8D dummy cycles for 200 Mhz Mask */

/* ---------------------------- Command Sequence to Change to Octal DDR ------------------------ */
#define CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET      (3U)                   /**< Octal DDR enable command 1 sequence length byte offset */
#define CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET      (11U)                  /**< Octal DDR enable command 1 sequence length byte offset */
#define CY_SMIF_SFDP_ODDR_CMD_SEQ_MAX_LEN           (8U)                   /**< Octal DDR enable command sequence maximum length */

/* --------------------------------- HyperBus Macros ------------------------------------------- */
#if (CY_IP_MXSMIF_VERSION>=2)
/** Following Hyperbus commands are to be used in a sequence as specified in the Hyper Flash/RAM data sheet.
    Please check the Command Summery section in the respective data sheet for the sequence to be followed. */
/** LLD Command Definition */
#define CY_SMIF_NOR_CFI_QUERY_CMD                         (0x98)           /**< HyperBus NOR CFI Query Command */
#define CY_SMIF_NOR_CHIP_ERASE_CMD                        (0x10)           /**< HyperBus NOR Chip Erase Command */
#define CY_SMIF_NOR_ERASE_SETUP_CMD                       (0x80)           /**< HyperBus NOR Erase Setup Command */
#define CY_SMIF_NOR_RESET_CMD                             (0xF0)           /**< HyperBus NOR Reset Command */
#define CY_SMIF_NOR_SECSI_SECTOR_ENTRY_CMD                (0x88)           /**< HyperBus NOR SECI Sector Entry Command */
#define CY_SMIF_NOR_SECTOR_ERASE_CMD                      (0x30)           /**< HyperBus NOR Sector Erase Command */
#define CY_SMIF_NOR_WRITE_BUFFER_LOAD_CMD                 (0x25)           /**< HyperBus NOR Write Buffer load Command */
#define CY_SMIF_NOR_WRITE_BUFFER_PGM_CONFIRM_CMD          (0x29)           /**< HyperBus NOR Write Buffer Program Confirm Command */
#define CY_SMIF_NOR_SET_CONFIG_CMD                        (0xD0)           /**< HyperBus NOR Set Config Command */
#define CY_SMIF_NOR_BIT_FIELD_CMD                         (0xBF)           /**< HyperBus NOR Bit Field Command */

#define CY_SMIF_NOR_ERASE_SUSPEND_CMD                     (0xB0)           /**< HyperBus NOR Erase Suspend Command */
#define CY_SMIF_NOR_ERASE_RESUME_CMD                      (0x30)           /**< HyperBus NOR Erase Resume Command */
#define CY_SMIF_NOR_PROGRAM_SUSPEND_CMD                   (0x51)           /**< HyperBus NOR Program Suspend Command */
#define CY_SMIF_NOR_PROGRAM_RESUME_CMD                    (0x50)           /**< HyperBus NOR Program Resume Command */
#define CY_SMIF_NOR_STATUS_REG_READ_CMD                   (0x70)           /**< HyperBus NOR Status Register Read Command */
#define CY_SMIF_NOR_STATUS_REG_CLEAR_CMD                  (0x71)           /**< HyperBus NOR Status Register Clear Command */
#define CY_SMIF_NOR_BLANK_CHECK_CMD                       (0x33)           /**< HyperBus NOR Blank Check Command */

#define CY_SMIF_ENTER_SPI_MODE_CMD                        (0xF5)           /**< HyperBus NOR Enter SPI Mode Command */

