PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_smif_memslot.h
/** Command code definition */
#define CY_SMIF_NOR_AUTOSELECT_CMD                        (0x90)           /**< HyperBus NOR Auto Select Command */
#define CY_SMIF_NOR_PROGRAM_CMD                           (0xA0)           /**< HyperBus NOR Program Command */
#define CY_SMIF_NOR_SECSI_SECTOR_EXIT_SETUP_CMD           (0x90)           /**< HyperBus NOR SECSI Sector Exit Setup Command */
#define CY_SMIF_NOR_SECSI_SECTOR_EXIT_CMD                 (0x00)           /**< HyperBus NOR SECSI Sector Exit Command */
#define CY_SMIF_NOR_UNLOCK_BYPASS_ENTRY_CMD               (0x20)           /**< HyperBus NOR Unlock Bypass Entry Command */
#define CY_SMIF_NOR_UNLOCK_BYPASS_PROGRAM_CMD             (0xA0)           /**< HyperBus NOR Unlock Bypass Program Command */
#define CY_SMIF_NOR_UNLOCK_BYPASS_RESET_CMD1              (0x90)           /**< HyperBus NOR Unlock Bypass Reset Command One */
#define CY_SMIF_NOR_UNLOCK_BYPASS_RESET_CMD2              (0x00)           /**< HyperBus NOR Unlock Bypass Reset Command Two*/
#define CY_SMIF_NOR_UNLOCK_DATA1                          (0xAA)           /**< HyperBus NOR Unlock Data One */
#define CY_SMIF_NOR_UNLOCK_DATA2                          (0x55)           /**< HyperBus NOR Unlock Data Two */
#define CY_SMIF_NOR_SUSPEND_CMD                           (0xB0)           /**< HyperBus NOR Suspend Command */
#define CY_SMIF_NOR_RESUME_CMD                            (0x30)           /**< HyperBus NOR Resume Command */
#define CY_SMIF_NOR_READ_CONFIG_CMD                       (0xC6)           /**< HyperBus NOR Read Config Command */
#define CY_SMIF_NOR_WRITE_BUFFER_ABORT_RESET_CMD          (0xF0)           /**< HyperBus NOR Write Buffer Abort Reset Command */

/** ---------------------------- Hyperbus Devise status register information -------------------- */

#define CY_SMIF_DEV_RDY_MASK                              (0x80) /**< Device Ready Bit */
#define CY_SMIF_DEV_ERASE_SUSP_MASK                       (0x40) /**< Erase Suspend Bit */
#define CY_SMIF_DEV_ERASE_MASK                            (0x20) /**< Erase Status Bit */
#define CY_SMIF_DEV_PROGRAM_MASK                          (0x10) /**< Program Status Bit */
#define CY_SMIF_DEV_RFU_MASK                              (0x08) /**< Reserved */
#define CY_SMIF_DEV_PROGRAM_SUSP_MASK                     (0x04) /**< Program Suspend Bit */
#define CY_SMIF_DEV_SEC_LOCK_MASK                         (0x02) /**< Sector lock Bit */
#define CY_SMIF_DEV_BANK_MASK                             (0x01) /**< Operation in current bank */
#define CY_SMIF_DEV_CRCSSB_MASK                           (0x0100)  /**< CRC Suspend Bit, 1: suspend, 0: no suspend*/
#define CY_SMIF_DEV_ESTAT_MASK                            (0x01)    /**< Sector Erase Status Bit (for Evaluate Erase Status)*/
/**<0=previous erase did not complete successfully*/
/**<1=previous erase completed successfully*/


#define CY_SMIF_HB_FLASH_UNLOCK_ADDR1        0x00000555    /**< HyperBus Unlock Address One */
#define CY_SMIF_HB_FLASH_UNLOCK_ADDR2        0x000002AA    /**< HyperBus Unlock Address Two */
#define CY_SMIF_HB_FLASH_CFI_UNLOCK_ADDR1    0x00000055    /**< HyperBus CFI Unlock Address One */
typedef uint32_t              CY_SMIF_FLASHDATA;           /**< HyperBus Flash Data Type */
#endif /* (CY_IP_MXSMIF_VERSION>=2) */

#define CY_SMIF_TAP_NOT_FOUND                          0xFFU         /**< Delay tap matching to memory not found */
#define CY_SMIF_MEM_CALIBRATION_DATA_PATTERN_LENGTH    12U           /**< Pattern length used for memory read transaction calibration */

/** \cond INTERNAL */

#if (CY_IP_MXSMIF_VERSION>=2)
/*****************************************************
* Define Hyper Flash/RAM read/write macro to be used by LLD    *
*****************************************************/
#define CY_SMIF_FLASH_OFFSET(b,o)       (*(( (volatile CY_SMIF_FLASHDATA*)(b) ) + (o)))

#if (CY_CPU_CORTEX_M7)
#define CY_SMIF_FLASH_WR(b,o,d)\
  {\
    __DMB();\
    CY_SMIF_FLASH_OFFSET((b),(o)) = (d);\
  }
#else
#define CY_SMIF_FLASH_WR(b,o,d) CY_SMIF_FLASH_OFFSET((b),(o)) = (d)
#endif
#define CY_SMIF_FLASH_RD(b,o)   CY_SMIF_FLASH_OFFSET((b),(o))

#define CY_SMIF_HB_FLASH_BUF_SIZE_MULTIPLIER 1
#define HB_REG_SIZE_IN_HALFWORD 1

#endif /* (CY_IP_MXSMIF_VERSION>=2) */


/*******************************************************************************
* These are legacy constants and API. They are left here just
* for backward compatibility.
* Do not use them in new designs.
*******************************************************************************/

#define CY_SMIF_FLAG_WR_EN                          CY_SMIF_FLAG_WRITE_ENABLE
#define CY_SMIF_FLAG_CRYPTO_EN                      CY_SMIF_FLAG_CRYPTO_ENABLE
#define CY_SMIF_SFDP_SING_BYTE_00                   CY_SMIF_SFDP_SIGNATURE_BYTE_00
#define CY_SMIF_SFDP_SING_BYTE_01                   CY_SMIF_SFDP_SIGNATURE_BYTE_01
#define CY_SMIF_SFDP_SING_BYTE_02                   CY_SMIF_SFDP_SIGNATURE_BYTE_02
#define CY_SMIF_SFDP_SING_BYTE_03                   CY_SMIF_SFDP_SIGNATURE_BYTE_03
#define CY_SMIF_WR_STS_REG1_CMD                     CY_SMIF_WRITE_STATUS_REG1_CMD
#define CY_SMIF_WR_DISABLE_CMD                      CY_SMIF_WRITE_DISABLE_CMD
#define CY_SMIF_RD_STS_REG1_CMD                     CY_SMIF_READ_STATUS_REG1_CMD
#define CY_SMIF_WR_ENABLE_CMD                       CY_SMIF_WRITE_ENABLE_CMD
#define CY_SMIF_RD_STS_REG2_T1_CMD                  CY_SMIF_READ_STATUS_REG2_T1_CMD
#define CY_SMIF_WR_STS_REG2_CMD                     CY_SMIF_WRITE_STATUS_REG2_CMD
#define CY_SMIF_RD_STS_REG2_T2_CMD                  CY_SMIF_READ_STATUS_REG2_T2_CMD
#define CY_SMIF_QE_BIT_STS_REG2_T1                  CY_SMIF_QE_BIT_STATUS_REG2_T1
#define CY_SMIF_STS_REG_BUSY_MASK                   CY_SMIF_STATUS_REG_BUSY_MASK

#define Cy_SMIF_Memslot_Init                        Cy_SMIF_MemInit
#define Cy_SMIF_Memslot_DeInit                      Cy_SMIF_MemDeInit
#define Cy_SMIF_Memslot_CmdWriteEnable              Cy_SMIF_MemCmdWriteEnable
#define Cy_SMIF_Memslot_CmdWriteDisable             Cy_SMIF_MemCmdWriteDisable
#define Cy_SMIF_Memslot_IsBusy                      Cy_SMIF_MemIsBusy
#define Cy_SMIF_Memslot_QuadEnable                  Cy_SMIF_MemQuadEnable
#define Cy_SMIF_Memslot_CmdReadSts                  Cy_SMIF_MemCmdReadStatus
#define Cy_SMIF_Memslot_CmdWriteSts                 Cy_SMIF_MemCmdWriteStatus
#define Cy_SMIF_Memslot_CmdChipErase                Cy_SMIF_MemCmdChipErase
#define Cy_SMIF_Memslot_CmdSectorErase              Cy_SMIF_MemCmdSectorErase
#define Cy_SMIF_Memslot_SfdpDetect                  Cy_SMIF_MemSfdpDetect
#define Cy_SMIF_Memslot_CmdProgram                  Cy_SMIF_MemCmdProgram
#define Cy_SMIF_Memslot_CmdRead                     Cy_SMIF_MemCmdRead

#define PARAM_ID_MSB_OFFSET                         (0x08U)  /* The offset of Parameter ID MSB */
#define PARAM_ID_LSB_MASK                           (0xFFUL) /* The mask of Parameter ID LSB */
#define MEM_ADDR_VALID(addr, size) (0U == ((addr)%(size)))  /* This address must be a multiple of
                                                             * the SMIF XIP memory size
                                                             */
#define MEM_MAPPED_SIZE_VALID(size) (((size) >= 0x10000U) && (0U == ((size)&((size)-1U))) )
#define MEM_ADDR_SIZE_VALID(addrSize)  ((0U < (addrSize)) && ((addrSize) <= CY_SMIF_FOUR_BYTES_ADDR))

/* ----------------------------------------- HyperBus Internal definitions ----------------------------------- */
#if (CY_IP_MXSMIF_VERSION>=2)


/* Hyperbus address format
 *
 */

#define SMIF_HYPERBUS_ADR_LOWER_COL_ADDRESS_Pos                0UL
#define SMIF_HYPERBUS_ADR_LOWER_COL_ADDRESS_Msk                0x7UL
#define SMIF_HYPERBUS_ADR_BYTE_ENABLE_Pos                      13UL
#define SMIF_HYPERBUS_ADR_BYTE_ENABLE_Msk                      0x6000UL
#define SMIF_HYPERBUS_ADR_ROW_AND_UPPER_COL_ADDRESS_Pos        16UL
#define SMIF_HYPERBUS_ADR_ROW_AND_UPPER_COL_ADDRESS_Msk        0xFFFF0000UL

#define SMIF_HYPERBUS_CMD_ADDRESS_LAST_BYTE_Pos            0UL
#define SMIF_HYPERBUS_CMD_ADDRESS_LAST_BYTE_Msk            0x3FUL
#define SMIF_HYPERBUS_CMD_BURST_TYPE_Pos                   13UL
#define SMIF_HYPERBUS_CMD_BURST_TYPE_Msk                   0x2000UL
#define SMIF_HYPERBUS_CMD_TARGET_TYPE_Pos                  14UL
#define SMIF_HYPERBUS_CMD_TARGET_TYPE_Msk                  0x4000UL
#define SMIF_HYPERBUS_CMD_READ_WRITE_Pos                   15UL
#define SMIF_HYPERBUS_CMD_READ_WRITE_Msk                   0x8000UL
#endif /* (CY_IP_MXSMIF_VERSION>=2) */

/** \endcond */
/** \} group_smif_macros_sfdp */


/**
* \addtogroup group_smif_data_structures_memslot
* \{
*/

/** This command structure is used to store the Read/Write command
 * configuration. */
typedef struct
{
    uint32_t command;                       /**< The 8-bit command. This value is 0xFFFFFFFF when there is no command present */
    cy_en_smif_txfr_width_t cmdWidth;       /**< The width of the command transfer */
    cy_en_smif_txfr_width_t addrWidth;      /**< The width of the address transfer */
    uint32_t mode;                          /**< The 8-bit mode byte. This value is 0xFFFFFFFF when there is no mode present */
    cy_en_smif_txfr_width_t modeWidth;      /**< The width of the mode transfer */
    uint32_t dummyCycles;                   /**< The number of the dummy cycles. A zero value suggests no dummy cycles */
    cy_en_smif_txfr_width_t dataWidth;      /**< The width of the data transfer */
#if (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN)
    cy_en_smif_data_rate_t dataRate;           /**< The Data rate of data */
    cy_en_smif_field_presence_t dummyCyclesPresence;   /**< This specifies the presence of the dummy field */
    cy_en_smif_field_presence_t modePresence;  /**< This specifies the presence of the mode field */
    uint32_t modeH;                            /**< The 8-bit command. This value is 0x0 when there is no higher byte mode present */
    cy_en_smif_data_rate_t modeRate;           /**< The Data rate of mode */
    cy_en_smif_data_rate_t addrRate;           /**< The Data rate of address */
    cy_en_smif_field_presence_t cmdPresence;   /**< This specifies the presence of the command field */
    uint32_t commandH;                         /**< The 8-bit command. This value is 0x0 when there is no higher byte command present */
    cy_en_smif_data_rate_t cmdRate;            /**< The Data rate of command */
#endif /* CY_IP_MXSMIF_VERSION */
} cy_stc_smif_mem_cmd_t;

/** This structure specifies data used for memory with hybrid sectors */
typedef struct
{
    uint32_t regionAddress;                 /**< This specifies the address where a region starts */
    uint32_t sectorsCount;                  /**< This specifies the number of sectors in the region */
    uint32_t eraseCmd;                      /**< This specifies the region specific erase instruction */
    uint32_t eraseSize;                     /**< This specifies the size of one sector */
    uint32_t eraseTime;                     /**< Max time for sector erase type 1 cycle time in ms */
} cy_stc_smif_hybrid_region_info_t;

#if(CY_IP_MXSMIF_VERSION>=2)
/** This structure specifies data used for memory with hybrid sectors */
typedef struct
{
    uint8_t cmdSeq1Len;                                   /**< This specifies command sequence 1 length. */
    uint8_t cmdSeq2Len;                                   /**< This specifies command sequence 2 length. */
    uint8_t cmdSeq1[CY_SMIF_SFDP_ODDR_CMD_SEQ_MAX_LEN];   /**< This specifies command sequence 1. */
    uint8_t cmdSeq2[CY_SMIF_SFDP_ODDR_CMD_SEQ_MAX_LEN];   /**< This specifies command sequence 2. */
} cy_stc_smif_octal_ddr_en_seq_t;
#endif


/* ------------------------------------------------- HyperBus Enums ---------------------------------------------- */
#if (CY_IP_MXSMIF_VERSION>=2)

/** Specifies top 8 bit of read/write sequence (bit 47 ~ bit 40). only top 3 bits have meaning */
/** bit 47: Identifies the transaction as a Read or Write. R/W#=1 indicates a Read operation and R/W#=0 indicates a Write operation. */
/** bit 46: Indicates whether the Read or Write operation accesses the memory or register spaces. */
/** bit 45: Indicates whether the burst will be continuous or wrapped. Burst Type=0 indicates Wrapped Burst, Burst Type=1 indicates Continuous Burst. */
/** bit 46 is always 0, since this drive assumes accessing memory space in XIP mode */
typedef enum
{
    CY_SMIF_HB_READ_WRAPPED_BURST    = 0x80, /**< bit 47 = 1: read, bit 45 = 0: wrapped burst */
    CY_SMIF_HB_READ_CONTINUOUS_BURST = 0xA0, /**< bit 47 = 1: read, bit 45 = 1: continuous burst */
} cy_en_smif_hb_rd_cmd_t;

