PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_smif_memslot.h
/** see \ref cy_en_smif_hb_rd_cmd_t */
typedef enum
{
    CY_SMIF_HB_WRITE_WRAPPED_BURST    = 0x00, /**< bit 47 = 0: write, bit 45 = 0: wrapped burst */
    CY_SMIF_HB_WRITE_CONTINUOUS_BURST = 0x20, /**< bit 47 = 0: write, bit 45 = 1: continuous burst */
} cy_en_smif_hb_wt_cmd_t;

/** Specifies hyper bus device type. FLASH or SRAM */
typedef enum
{
    CY_SMIF_HB_FLASH = 0, /**< Hyper bus FLASH */
    CY_SMIF_HB_SRAM  = 1, /**< Hyper bus SRAM */
} cy_en_smif_hb_dev_type_t;

/** The size of the device region specified by DEVICE_MASK register */
typedef enum // casting int32_t is to avoid compiler error.
{
    CY_SMIF_DEVICE_1M_BYTE   = (int32_t)(0xFFF00000UL), /**< for 1M size device */
    CY_SMIF_DEVICE_2M_BYTE   = (int32_t)(0xFFE00000UL), /**< for 2M size device */
    CY_SMIF_DEVICE_4M_BYTE   = (int32_t)(0xFFC00000UL), /**< for 4M size device */
    CY_SMIF_DEVICE_8M_BYTE   = (int32_t)(0xFF800000UL), /**< for 8M size device */
    CY_SMIF_DEVICE_16M_BYTE  = (int32_t)(0xFF000000UL), /**< for 16M size device */
    CY_SMIF_DEVICE_32M_BYTE  = (int32_t)(0xFE000000UL), /**< for 32M size device */
    CY_SMIF_DEVICE_64M_BYTE  = (int32_t)(0xFC000000UL), /**< for 64M size device */
    CY_SMIF_DEVICE_128M_BYTE = (int32_t)(0xF8000000UL), /**< for 128M size device */
    CY_SMIF_DEVICE_256M_BYTE = (int32_t)(0xF0000000UL), /**< for 256M size device */
    CY_SMIF_DEVICE_512M_BYTE = (int32_t)(0xE0000000UL), /**< for 512M size device */
    CY_SMIF_DEVICE_1G_BYTE   = (int32_t)(0xC0000000UL), /**< for 1G size device */
    CY_SMIF_DEVICE_2G_BYTE   = (int32_t)(0x80000000UL), /**< for 2G size device */
    CY_SMIF_DEVICE_4G_BYTE   = (int32_t)(0x00000000UL), /**< for 4G size device */
} cy_en_device_size_t;

/** Specifies the size of a memory sub page */
typedef enum
{
    SUB_PAGE_SIZE_8BYTE  = 0, /**< sub_page_size = 8 words = 16 bytes (default) */
    SUB_PAGE_SIZE_16BYTE = 1, /**< sub_page_size = 16 words = 32 bytes */
    SUB_PAGE_SIZE_32BYTE = 2, /**< sub_page_size = 32 words = 64 bytes */
    SUB_PAGE_SIZE_64BYTE = 3,/**< sub_page_size = 64 words = 128 bytes */
} en_cy_sub_page_size_t;

/** Specifies the number of sub pages per page */
typedef enum
{
    SUB_PAGE_1_PER_PAGE = 0, /**< 1 sub pages per page, i.e. page_size = sub_page_size */
    SUB_PAGE_2_PER_PAGE = 1, /**< 2 sub pages per page, i.e. page_size = 2 x sub_page_size */
    SUB_PAGE_4_PER_PAGE = 2, /**< 4 sub pages per page, i.e. page_size = 4 x sub_page_size */
    SUB_PAGE_8_PER_PAGE = 3, /**< 8 sub pages per page, i.e. page_size = 8 x sub_page_size */
} en_cy_sub_page_nr_t;

/** Specifies the size of the XIP device address in Bytes */
typedef enum
{
    CY_SMIF_XIP_ADDRESS_1_BYTE = 0, /**< 1 Byte address */
    CY_SMIF_XIP_ADDRESS_2_BYTE = 1, /**< 2 Byte address */
    CY_SMIF_XIP_ADDRESS_3_BYTE = 2, /**< 3 Byte address */
    CY_SMIF_XIP_ADDRESS_4_BYTE = 3, /**< 4 Byte address */
    CY_SMIF_XIP_ADDRESS_5_BYTE = 7, /**< 4 Byte address (spread over 5 bytes) according to Hyperbus protocol */
} cy_en_smif_xip_addr_byte_t;

/** Specify whether command to be transmitted is last one or not */
typedef enum
{
    NOT_LAST_COMMAND = 0, /**< not last command */
    LAST_COMMAND_BYTE = 1,/**< last command */
} cy_en_smif_cmd_last_t;

typedef enum
{
    CY_SMIF_HB_WRAPPED_BURST    = 0, /**< continue to wrap within the burst length */
    CY_SMIF_HB_COUTINUOUS_BURST = 1, /**< output data in a sequential manner across page boundaries */
} cy_en_hb_burst_type_t;

/** read target. memory or register */
typedef enum
{
    CY_SMIF_HB_TARGET_MEMORY   = 0, /**< memory */
    CY_SMIF_HB_TARGET_REGISTER = 1, /**< register. it is used only for hyper SRAM */
} cy_en_hb_target_t;

/** read or write */
typedef enum
{
    CY_SMIF_HB_WRITE   = 0, /**< write */
    CY_SMIF_HB_READ    = 1, /**< read */
} cy_en_hb_read_write_t;


/* ----------------------------------------------------- HyperBus Data Structures ----------------------------------- */


typedef struct
{
    cy_en_smif_hb_rd_cmd_t         xipReadCmd;         /**< read command value \ref cy_en_smif_hb_rd_cmd_t */
    cy_en_smif_hb_wt_cmd_t         xipWriteCmd;        /**< write command value \ref cy_en_smif_hb_rd_cmd_t */
    cy_en_smif_hb_dev_type_t       hbDevType;          /**< hyper bus device type \ref cy_en_smif_hb_dev_type_t */
    cy_en_device_size_t            memSize;            /**< The memory size: For densities of 2 gigabits or less - the size in bytes;
                                                          * For densities 4 gigabits and above - bit-31 is set to 1b to define that
                                                          * this memory is 4 gigabits and above; and other 30:0 bits define N where
                                                          * the density is computed as 2^N bytes.
                                                          * For example, 0x80000021 corresponds to 2^30 = 1 gigabyte.
                                                          */
    uint32_t                       dummyCycles;        /**< dummy Cycles based on Frequency of operation */
} cy_stc_smif_hbmem_device_config_t;
#endif  /* (CY_IP_MXSMIF_VERSION>=2) */
/**
*
* This configuration structure of the SMIF memory device is used to store
* device-specific parameters.
* These parameters are used to set up the memory mode initialization and the
* memory API.
*/
typedef struct
{
    uint32_t numOfAddrBytes;                              /**< This specifies the number of address bytes used by the
                                                          * memory slave device, valid values 1-4 */
    uint32_t memSize;                                     /**< The memory size: For densities of 2 gigabits or less - the size in bytes;
                                                          * For densities 4 gigabits and above - bit-31 is set to 1b to define that
                                                          * this memory is 4 gigabits and above; and other 30:0 bits define N where
                                                          * the density is computed as 2^N bytes.
                                                          * For example, 0x80000021 corresponds to 2^30 = 1 gigabyte.
                                                          */
    cy_stc_smif_mem_cmd_t *readCmd;                       /**< This specifies the Read command */
    cy_stc_smif_mem_cmd_t *writeEnCmd;                    /**< This specifies the Write Enable command */
    cy_stc_smif_mem_cmd_t *writeDisCmd;                   /**< This specifies the Write Disable command */
    cy_stc_smif_mem_cmd_t *eraseCmd;                      /**< This specifies the Erase command */
    uint32_t eraseSize;                                   /**< This specifies the sector size of each Erase */
    cy_stc_smif_mem_cmd_t *chipEraseCmd;                  /**< This specifies the Chip Erase command */
    cy_stc_smif_mem_cmd_t *programCmd;                    /**< This specifies the Program command */
    uint32_t programSize;                                 /**< This specifies the page size for programming */
    cy_stc_smif_mem_cmd_t *readStsRegWipCmd;              /**< This specifies the command to read the WIP-containing status register  */
    cy_stc_smif_mem_cmd_t *readStsRegQeCmd;               /**< This specifies the command to read the QE-containing status register */
    cy_stc_smif_mem_cmd_t *writeStsRegQeCmd;              /**< This specifies the command to write into the QE-containing status register */
    cy_stc_smif_mem_cmd_t *readSfdpCmd;                   /**< This specifies the read SFDP command */
    uint32_t stsRegBusyMask;                              /**< The Busy mask for the status registers */
    uint32_t stsRegQuadEnableMask;                        /**< The QE mask for the status registers */
    uint32_t eraseTime;                                   /**< Max time for erase type 1 cycle time in ms */
    uint32_t chipEraseTime;                               /**< Max time for chip erase cycle time in ms */
    uint32_t programTime;                                 /**< Max time for page program cycle time in us */
    uint32_t hybridRegionCount;                           /**< This specifies the number of regions for memory with hybrid sectors */
    cy_stc_smif_hybrid_region_info_t **hybridRegionInfo;  /**< This specifies data for memory with hybrid sectors */
    cy_stc_smif_mem_cmd_t *readLatencyCmd;                   /**< This specifies the command to read variable latency cycles configuration register */
    cy_stc_smif_mem_cmd_t *writeLatencyCmd;               /**< This specifies the command to write variable latency cycles configuration register */
    uint32_t latencyCyclesRegAddr;                        /**< This specifies the address for variable latency cycle address */
    uint32_t latencyCyclesMask;                           /**< This specifies variable latency cycles Mask */
#if(CY_IP_MXSMIF_VERSION>=2)
    cy_stc_smif_octal_ddr_en_seq_t *octalDDREnableSeq;    /**< This specifies data for memory with hybrid sectors */
    cy_stc_smif_mem_cmd_t *readStsRegOeCmd;               /**< This specifies the command to read the OE-containing status register */
    cy_stc_smif_mem_cmd_t *writeStsRegOeCmd;              /**< This specifies the command to write into the OE-containing status register */
    uint32_t stsRegOctalEnableMask;                       /**< The QE mask for the status registers */
    uint32_t octalEnableRegAddr;                          /**< Octal enable register address */
    cy_en_smif_interface_freq_t freq_of_operation;        /**< Frequency of operation used in Octal mode */
#endif
} cy_stc_smif_mem_device_cfg_t;


/**
*
* This SMIF memory configuration structure is used to store the memory configuration for the memory mode of operation.
* This data structure is stored in a fixed location in the flash. The data structure is required
* for the initialization of the SMIF in the SystemInit.
*/
typedef struct
{
    /** Determines the slave select where the memory device is placed */
    cy_en_smif_slave_select_t slaveSelect;
    /** Determines if the device is memory-mapped, enables the Autodetect
     * using the SFDP, enables the write capability, or enables the crypto
     * support for this memory slave */
    uint32_t flags;
    /** The data-line selection options for a slave device */
    cy_en_smif_data_select_t dataSelect;
    /** The base address the memory slave is mapped to in the PSoC memory map.
     * This address must be a multiple of the SMIF XIP memory size/capacity. The
     * SMIF XIP memory region should NOT overlap with other memory regions
     * (with exception to dual quad mode). Valid when the memory-mapped mode is
     * enabled.
     */
    uint32_t baseAddress;
    /** The size/capacity allocated in the PSoC memory map for the memory slave
     * device. The capacity is allocated from the base address. The capacity
     * must be a power of 2 and greater or equal than 64 KB. Valid when
     * memory-mapped mode is enabled
     */
    uint32_t memMappedSize;
    /** Defines if this memory device is one of the devices in the dual quad SPI
     * configuration. Equals the sum of the slave-slot numbers.  */
    uint32_t dualQuadSlots;
    cy_stc_smif_mem_device_cfg_t *deviceCfg;   /**< The configuration of the device */
#if(CY_IP_MXSMIF_VERSION>=2)
    /** Continuous transfer merge timeout.
     * After this period the memory device is deselected. A later transfer, even from a
     * continuous address, starts with the overhead phases (command, address, mode, dummy cycles). */
    cy_en_smif_merge_timeout_t mergeTimeout;

    cy_stc_smif_hbmem_device_config_t *hbdeviceCfg;  /**< The configuration of the hyperbus device */
#endif /* CY_IP_MXSMIF_VERSION */

