PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_smif_memslot.h
} cy_stc_smif_mem_config_t;


/**
*
* This SMIF memory configuration structure is used to store the memory configuration for the memory mode of operation.
* This data structure is stored in a fixed location in the flash. The data structure is required
* for the initialization of the SMIF in the SystemInit.
*/
typedef struct
{
    uint32_t memCount;                         /**< The number of SMIF memory defined  */
    cy_stc_smif_mem_config_t **memConfig;      /**< The pointer to the array of the memory configuration structures of size Memory_count */
    uint32_t majorVersion;                     /**< The version of the SMIF driver */
    uint32_t minorVersion;                     /**< The version of the SMIF Driver */
} cy_stc_smif_block_config_t;


/** \} group_smif_data_structures_memslot */


/**
* \addtogroup group_smif_mem_slot_functions
* \{
*/
cy_en_smif_status_t    Cy_SMIF_MemInit(SMIF_Type *base,
                                       cy_stc_smif_block_config_t const * blockConfig,
                                       cy_stc_smif_context_t *context);
void        Cy_SMIF_MemDeInit(SMIF_Type *base);
cy_en_smif_status_t    Cy_SMIF_MemCmdWriteEnable(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        cy_stc_smif_context_t const *context);
cy_en_smif_status_t    Cy_SMIF_MemCmdWriteDisable(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        cy_stc_smif_context_t const *context);
bool Cy_SMIF_MemIsBusy(SMIF_Type *base, cy_stc_smif_mem_config_t const *memDevice,
                       cy_stc_smif_context_t const *context);
cy_en_smif_status_t    Cy_SMIF_MemQuadEnable(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        cy_stc_smif_context_t const *context);
#if (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN)
cy_en_smif_status_t Cy_SMIF_MemOctalEnable(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        cy_en_smif_data_rate_t dataRate,
        cy_stc_smif_context_t const *context);
#endif

cy_en_smif_status_t Cy_SMIF_MemCmdReadStatus(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        uint8_t *status, uint8_t command,
        cy_stc_smif_context_t const *context);
cy_en_smif_status_t    Cy_SMIF_MemCmdWriteStatus(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        void const *status, uint8_t command,
        cy_stc_smif_context_t const *context);
cy_en_smif_status_t    Cy_SMIF_MemCmdChipErase(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        cy_stc_smif_context_t const *context);
cy_en_smif_status_t    Cy_SMIF_MemCmdSectorErase(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        uint8_t const *sectorAddr,
        cy_stc_smif_context_t const *context);
cy_en_smif_status_t    Cy_SMIF_MemCmdProgram(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        uint8_t const *addr,
        uint8_t const *writeBuff,
        uint32_t size,
        cy_smif_event_cb_t cmdCompleteCb,
        cy_stc_smif_context_t *context);
cy_en_smif_status_t    Cy_SMIF_MemCmdRead(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        uint8_t const *addr,
        uint8_t *readBuff,
        uint32_t size,
        cy_smif_event_cb_t cmdCompleteCb,
        cy_stc_smif_context_t *context);
cy_en_smif_status_t    Cy_SMIF_MemSfdpDetect(SMIF_Type *base,
        cy_stc_smif_mem_device_cfg_t *device,
        cy_en_smif_slave_select_t slaveSelect,
        cy_en_smif_data_select_t dataSelect,
        cy_stc_smif_context_t *context);

void Cy_SMIF_Reset_Memory(SMIF_Type *base, cy_en_smif_slave_select_t slaveSelect);

cy_en_smif_status_t Cy_SMIF_MemInitSfdpMode(SMIF_Type *base,
        const cy_stc_smif_mem_config_t *memCfg,
        cy_en_smif_txfr_width_t maxdataWidth,
        cy_en_smif_qer_t qer_id,
        cy_stc_smif_context_t *context);

cy_en_smif_status_t Cy_SMIF_MemIsReady(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig,
                                       uint32_t timeoutUs, cy_stc_smif_context_t const *context);
cy_en_smif_status_t Cy_SMIF_MemIsQuadEnabled(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig,
        bool *isQuadEnabled, cy_stc_smif_context_t const *context);
cy_en_smif_status_t Cy_SMIF_MemEnableQuadMode(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig,
        uint32_t timeoutUs, cy_stc_smif_context_t const *context);
cy_en_smif_status_t Cy_SMIF_MemRead(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig,
                                    uint32_t address, uint8_t rxBuffer[],
                                    uint32_t length, cy_stc_smif_context_t const *context);
cy_en_smif_status_t Cy_SMIF_MemWrite(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig,
                                     uint32_t address, uint8_t const txBuffer[],
                                     uint32_t length, cy_stc_smif_context_t const *context);
cy_en_smif_status_t Cy_SMIF_MemEraseSector(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig,
        uint32_t address, uint32_t length,
        cy_stc_smif_context_t const *context);
cy_en_smif_status_t Cy_SMIF_MemEraseChip(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig,
        cy_stc_smif_context_t const *context);
cy_en_smif_status_t Cy_SMIF_MemLocateHybridRegion(cy_stc_smif_mem_config_t const *memDevice,
        cy_stc_smif_hybrid_region_info_t **regionInfo, uint32_t address);
void Cy_SMIF_SetReadyPollingDelay(uint16_t pollTimeoutUs,
                                  cy_stc_smif_context_t *context);
cy_en_smif_status_t Cy_SMIF_MemCmdPowerDown(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        cy_stc_smif_context_t const *context);

cy_en_smif_status_t Cy_SMIF_MemCmdReleasePowerDown(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        cy_stc_smif_context_t const *context);

#if (CY_IP_MXSMIF_VERSION >= 5) || defined (CY_DOXYGEN)
void Cy_SMIF_MemEnableFWCalibration(SMIF_Type *base, cy_en_smif_slave_select_t slave);
void Cy_SMIF_MemDisableFWCalibration(SMIF_Type *base, cy_en_smif_slave_select_t slave);

