PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_smif_memslot.h
cy_en_smif_status_t Cy_SMIF_SetSelectedDelayTapSel(SMIF_Type *base, cy_en_smif_slave_select_t slave,
        cy_en_smif_mem_data_line_t data_line, uint8_t tapSel);
uint8_t Cy_SMIF_GetSelectedDelayTapSel(SMIF_Type *base, cy_en_smif_slave_select_t slave,
                                       cy_en_smif_mem_data_line_t data_line);

cy_en_smif_status_t Cy_SMIF_MemGetSDLTap(SMIF_Type *base,
        const cy_stc_smif_mem_config_t *memConfig,
        uint8_t *posTap, uint8_t *negTap);
cy_en_smif_status_t Cy_SMIF_MemSetSDLTap(SMIF_Type *base,
        const cy_stc_smif_mem_config_t *memConfig,
        uint8_t posTap, uint8_t negTap);

cy_en_smif_status_t Cy_SMIF_MemCalibrateSDL(SMIF_Type *base,
        const cy_stc_smif_mem_config_t *memConfig,
        uint32_t calibrationDataOffsetAddress,
        cy_stc_smif_context_t *context);
#endif

#if (CY_IP_MXSMIF_VERSION>=2)

/*******************************************************************************
* Function Name: Cy_SMIF_HyperBus_InitDevice
****************************************************************************//**
*
* This function sets up SMIF registers for hyper bus memory.
*
* \param device
* Holds the base address of the SMIF Device registers.
*
* \param memCfg
* Configuration to be applied to the SMIF device \ref cy_stc_smif_mem_config_t
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return
*     - \ref CY_SMIF_BAD_PARAM
*     - \ref CY_SMIF_SUCCESS
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_HyperBus
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_HyperBus_InitDevice(SMIF_Type *base, const cy_stc_smif_mem_config_t *memCfg, cy_stc_smif_context_t *context);

/*******************************************************************************
* Function Name: Cy_SMIF_HyperBus_CalibrateDelay
****************************************************************************//**
*
* This function reads the calibration data pattern in the Hyper memory for every
* delay tap of the currently selected delay line and records whether it matches
* the reference pattern. After all taps have been scanned, it determines the
* center tap of the longest sequence of matches and applies this tap.
*
* \note Function assumes that any SMIF has the same number of delay taps
*
* \param base
* Holds the base address of the SMIF Device registers.
*
* \param memConfig
* SMIF memory configuration structure for memory mode of operation.
*
* \param dummyCycles
* Dummy Cycles based on Frequency of operation
*
* \param calibrationDataOffsetFromBase
* Address offset of the calibration data from the device's XIP base address
*
* \param context
* Current SMIF driver context
*
* \return \ref cy_en_smif_status_t
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_HyperBus
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_HyperBus_CalibrateDelay(SMIF_Type *base, cy_stc_smif_mem_config_t *memConfig, uint8_t dummyCycles, uint32_t calibrationDataOffsetAddress, cy_stc_smif_context_t *context);

/*******************************************************************************
* Function Cy_SMIF_HyperBus_Read
****************************************************************************//**
*
* This function reads data from hyper bus memory in MMIO mode.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* SMIF memory configuration structure for memory mode of operation.
*
* \param burstType
* Specifies wrapped or continuous burst. \ref en_hb_bust_type_t
*
* \param readAddress
* Specifies address of external device to be read.
*
* \param sizeInHalfWord
* Specifies memory size to be read.
* Note hyper bus memory have 16bit data per each address.
*
* \param buf
* Pointer to buffer where read data to be stored
*
* \param dummyCycles
* Dummy Cycles based on Frequency of operation
*
* \param doubleLat
* double initial latency or single initial latency
*
* \param isblockingMode
* Blocking mode or not. if this is true, process waits for the read finished in this
* function. unless, the process does not wait and exit function.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \return \ref cy_en_smif_status_t
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_HyperBus
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_HyperBus_Read(SMIF_Type *base,
        const cy_stc_smif_mem_config_t *memConfig,
        cy_en_hb_burst_type_t burstType,
        uint32_t readAddress,
        uint32_t sizeInHalfWord,
        uint16_t buf[],
        uint32_t dummyCycles,
        bool doubleLat,
        bool isblockingMode,
        cy_stc_smif_context_t *context);

/*******************************************************************************
* Function Cy_SMIF_HyperBus_Write
****************************************************************************//**
*
* This function writes data into hyper bus memory in MMIO mode.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* SMIF memory configuration structure for memory mode of operation.
*
* \param burstType
* Specifies wrapped or continuous burst. \ref en_hb_bust_type_t
*
* \param writeAddress
* Specifies address of external device to be write.
*
* \param sizeInHalfWord
* Specifies memory size to be read.
* Note hyper bus memory have 16bit data per each address.
*
* \param buf
* Pointer to buffer where read data to be stored
*
* \param hbDevType
* Specifies hyper bus type. FLASH or SRAM. \ref cy_en_smif_hb_dev_type_t
*
* \param dummyCycles
* Dummy Cycles based on Frequency of operation.
*
* \param isblockingMode
* Blocking mode or not. if this is true, process waits for the read finished in this
* function. unless, the process does not wait and exit function.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \return \ref cy_en_smif_status_t
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_HyperBus
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_HyperBus_Write(SMIF_Type *base,
        const cy_stc_smif_mem_config_t *memConfig,
        cy_en_hb_burst_type_t burstType,
        uint32_t writeAddress,
        uint32_t sizeInHalfWord,
        uint16_t buf[],
        cy_en_smif_hb_dev_type_t hbDevType,
        uint32_t dummyCycles,
        bool isblockingMode,
        cy_stc_smif_context_t *context);

