PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_smif_memslot.h
/*******************************************************************************
* Function Cy_SMIF_HyperBus_MMIO_Write
****************************************************************************//**
*
* This function writes data into hyper bus memory in MMIO mode.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slave
* Specifies slave of external device to be read. \ref cy_en_smif_slave_select_t
*
* \param burstType
* Specifies wrapped or continuous burst. \ref en_hb_bust_type_t
*
* \param writeAddress
* Specifies address of external device to be write.
*
* \param sizeInHalfWord
* Specifies memory size to be read.
* Note hyper bus memory have 16bit data per each address.
*
* \param buf
* Pointer to buffer where read data to be stored
*
* \param hbDevType
* Specifies hyper bus type. FLASH or SRAM. \ref cy_en_smif_hb_dev_type_t
*
* \param dummyCycles
* Dummy Cycles based on Frequency of operation.
*
* \param isblockingMode
* Blocking mode or not. if this is true, process waits for the read finished in this
* function. unless, the process does not wait and exit function.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \return \ref cy_en_smif_status_t
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_HyperBus
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_HyperBus_MMIO_Write(SMIF_Type *base,
        cy_en_smif_slave_select_t slave,
        cy_en_hb_burst_type_t burstType,
        uint32_t writeAddress,
        uint32_t sizeInHalfWord,
        uint16_t buf[],
        cy_en_smif_hb_dev_type_t hbDevType,
        uint32_t dummyCycle,
        bool isblockingMode,
        cy_stc_smif_context_t *context);


/*******************************************************************************
* Function Name: CY_SMIF_HyperBus_ReadStatus
****************************************************************************//**
*
* This function reads the flash status register bits.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* SMIF memory configuration structure for memory mode of operation.
*
* \param regStatus
* output status register value.
*
* \return \ref cy_en_smif_status_t
*

*******************************************************************************/
cy_en_smif_status_t CY_SMIF_HyperBus_ReadStatus(SMIF_Type *base, const cy_stc_smif_mem_config_t *memConfig, uint16_t *regStatus, cy_stc_smif_context_t *context);

/*******************************************************************************
* Function Name: CY_SMIF_HyperBus_ClearStatus
****************************************************************************//**
*
* This function clears the flash status register bits.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* SMIF memory configuration structure for memory mode of operation.
*
* \return \ref cy_en_smif_status_t
*
*******************************************************************************/
cy_en_smif_status_t CY_SMIF_HyperBus_ClearStatus(SMIF_Type *base, cy_stc_smif_mem_config_t *memConfig, cy_stc_smif_context_t *context);

/*******************************************************************************
* Function Name: Cy_SMIF_HyperBus_EraseSector
****************************************************************************//**
*
* This function Erases the data in the given sector.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* SMIF memory configuration structure for memory mode of operation.
*
* \param offset
* offset of the sector to be erased.
*
* \return \ref cy_en_smif_status_t
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_HyperBus
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_HyperBus_EraseSector(SMIF_Type *base, const cy_stc_smif_mem_config_t *memConfig, uint32_t offset, cy_stc_smif_context_t *context);

/*******************************************************************************
* Function Name: Cy_SMIF_HyperBus_EraseChip
****************************************************************************//**
*
* This function Erases the data in the entire flash memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* SMIF memory configuration structure for memory mode of operation.
*
* \return \ref cy_en_smif_status_t
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_HyperBus_EraseChip(SMIF_Type *base, cy_stc_smif_mem_config_t *memConfig, cy_stc_smif_context_t *context);

#endif /* (CY_IP_MXSMIF_VERSION>=2) */

/** \} group_smif_mem_slot_functions */

__STATIC_INLINE void SfdpGetQuadEnableParameters(cy_stc_smif_mem_device_cfg_t *device,
        cy_en_smif_qer_t qerId);
__STATIC_INLINE void XipRegInit(SMIF_DEVICE_Type volatile *dev, cy_stc_smif_mem_config_t const * memCfg);

__STATIC_INLINE cy_en_smif_status_t ReadAnyReg(SMIF_Type *base,
        cy_en_smif_slave_select_t  slaveSelect,
        uint8_t *value,
        uint8_t command,
        uint8_t dummyCycles,
        uint8_t const *address,
        uint32_t addressSize,
        cy_stc_smif_context_t const *context);
__STATIC_INLINE void ValueToByteArray(uint32_t value, uint8_t *byteArray, uint32_t startPos, uint32_t size);
__STATIC_INLINE uint32_t ByteArrayToValue(uint8_t const *byteArray, uint32_t size);

/*******************************************************************************
* Function Name: SfdpGetQuadEnableParameters
****************************************************************************//**
*
* Gets the Quad Enable parameters.
*
* \param device
* The device structure instance declared by the user. This is where the detected
* parameters are stored and returned.
*
* \param qerId
* quad enable requirement ID
*
*******************************************************************************/
__STATIC_INLINE void SfdpGetQuadEnableParameters(cy_stc_smif_mem_device_cfg_t *device,
        cy_en_smif_qer_t qerId)
{
    CY_ASSERT_L1(NULL != device->readStsRegQeCmd);
    CY_ASSERT_L1(NULL != device->writeStsRegQeCmd);

    /* The command transfer width */
    device->writeStsRegQeCmd->cmdWidth = CY_SMIF_WIDTH_SINGLE;

    /* The QE mask for the status registers */
    switch (qerId)
    {
    case CY_SMIF_SFDP_QER_0:
        device->stsRegQuadEnableMask = CY_SMIF_NO_COMMAND_OR_MODE;
        device->writeStsRegQeCmd->command  = CY_SMIF_NO_COMMAND_OR_MODE;
        device->readStsRegQeCmd->command  = CY_SMIF_NO_COMMAND_OR_MODE;
#if (CY_IP_MXSMIF_VERSION>=2)
        device->writeStsRegQeCmd->cmdPresence  = CY_SMIF_NOT_PRESENT;
        device->readStsRegQeCmd->cmdPresence  = CY_SMIF_NOT_PRESENT;
#endif /* CY_IP_MXSMIF_VERSION */
        break;
    case CY_SMIF_SFDP_QER_1:
    case CY_SMIF_SFDP_QER_4:
    case CY_SMIF_SFDP_QER_5:
        device->stsRegQuadEnableMask = CY_SMIF_SFDP_QE_BIT_1_OF_SR_2;

        /* The command to write into the QE-containing status register */
        /* The 8-bit command. QE WRSR */
        device->writeStsRegQeCmd->command  = CY_SMIF_WRITE_STATUS_REG1_CMD;
        device->readStsRegQeCmd->command  = CY_SMIF_READ_STATUS_REG2_T1_CMD;
#if (CY_IP_MXSMIF_VERSION>=2)
        device->writeStsRegQeCmd->cmdPresence  = CY_SMIF_PRESENT_1BYTE;
        device->readStsRegQeCmd->cmdPresence  = CY_SMIF_PRESENT_1BYTE;
#endif /* CY_IP_MXSMIF_VERSION */
        break;
    case CY_SMIF_SFDP_QER_2:
        device->stsRegQuadEnableMask = CY_SMIF_SFDP_QE_BIT_6_OF_SR_1;

        /* The command to write into the QE-containing status register */
        /* The 8-bit command. QE WRSR */
        device->writeStsRegQeCmd->command  = CY_SMIF_WRITE_STATUS_REG1_CMD;
        device->readStsRegQeCmd->command  = CY_SMIF_READ_STATUS_REG1_CMD;
#if (CY_IP_MXSMIF_VERSION>=2)
        device->writeStsRegQeCmd->cmdPresence  = CY_SMIF_PRESENT_1BYTE;
        device->readStsRegQeCmd->cmdPresence  = CY_SMIF_PRESENT_1BYTE;
#endif /* CY_IP_MXSMIF_VERSION */
        break;
    case CY_SMIF_SFDP_QER_3:
        device->stsRegQuadEnableMask = CY_SMIF_SFDP_QE_BIT_7_OF_SR_2;

        /* The command to write into the QE-containing status register */
        /* The 8-bit command. QE WRSR */
        device->writeStsRegQeCmd->command  = CY_SMIF_WRITE_STATUS_REG2_T1_CMD;
        device->readStsRegQeCmd->command  = CY_SMIF_READ_STATUS_REG2_T2_CMD;
#if (CY_IP_MXSMIF_VERSION>=2)
        device->writeStsRegQeCmd->cmdPresence  = CY_SMIF_PRESENT_1BYTE;
        device->readStsRegQeCmd->cmdPresence  = CY_SMIF_PRESENT_1BYTE;
#endif /* CY_IP_MXSMIF_VERSION */
        break;
    case CY_SMIF_SFDP_QER_6:
        device->stsRegQuadEnableMask = CY_SMIF_SFDP_QE_BIT_1_OF_SR_2;

        /* The command to write into the QE-containing status register */
        /* The 8-bit command. QE WRSR */
        device->writeStsRegQeCmd->command  = CY_SMIF_WRITE_STATUS_REG2_T2_CMD;
        device->readStsRegQeCmd->command  = CY_SMIF_READ_STATUS_REG2_T1_CMD;
#if (CY_IP_MXSMIF_VERSION>=2)
        device->writeStsRegQeCmd->cmdPresence  = CY_SMIF_PRESENT_1BYTE;
        device->readStsRegQeCmd->cmdPresence  = CY_SMIF_PRESENT_1BYTE;
#endif /* CY_IP_MXSMIF_VERSION */
        break;
    default:
        /* Unsupported quad enable requirement */
        break;
    }
}

